gradle-introduction/gradle-introducao.org
#+SETUPFILE: ./../etc/org_mode_SETUPFILE.org
#+TITLE: Gradle Introdução
#+SUBTITLE: intermediario

* Introdução
  

* Instalação do Gradle e Conf do Path  
  
  Faça o download do gradle em 
  https://downloads.gradle.org/distributions/gradle-5.5-rc-4-bin.zip
  
  Descompacte em o gradle em algum diretório, eu descompactei o meu em
  
  /home/wagner/wagnerdocri@gmail.com3/fzlbpms/fzlStudio/integrated/build/gradle-5.1.1

  Agora crie a variável de ambiente GRADLE_HOME e configure o PATH da
  sua máquina.

  #+NAME: export env vars
  #+BEGIN_SRC shell :results output :exports both
     export GRADLE_HOME=/home/wagner/wagnerdocri@gmail.com3/fzlbpms/fzlStudio/integrated/build/gradle-5.1.1
     export PATH=$PATH:$GRADLE_HOME/bin     
     gradle -v
  #+END_SRC

  #+RESULTS:
  #+begin_example

  ------------------------------------------------------------
  Gradle 5.1.1
  ------------------------------------------------------------

  Build time:   2019-01-10 23:05:02 UTC
  Revision:     3c9abb645fb83932c44e8610642393ad62116807

  Kotlin DSL:   1.1.1
  Kotlin:       1.3.11
  Groovy:       2.5.4
  Ant:          Apache Ant(TM) version 1.9.13 compiled on July 10 2018
  JVM:          1.8.0_191 (Oracle Corporation 25.191-b12)
  OS:           Linux 5.1.18-200.fc29.x86_64 amd64

  #+end_example


* Criação de um projeto java básico
  https://guides.gradle.org/building-java-applications/

  Pra criar um projeto com gradle a gente cria uma pasta, entra nela e
  dá o comando gradle init + parametros.
  Esse "init" é um plugin do gradle[gradleCodsInitPlugin]
  
   #+NAME: criac proj java                    
   #+BEGIN_SRC shell :session s1 :results output :exports both
      #starts code
      export GRADLE_PROJECTS_DIR=/home/wagner/wagnerdocri@gmail.com3/envs/env-dev/sources/somewritings/gradle-introduction/projetos/                                 
      mkdir -p $GRADLE_PROJECTS_DIR
      
      cd $GRADLE_PROJECTS_DIR
      rm -rf demojavaproj
      mkdir demojavaproj && cd demojavaproj
      echo 1 | gradle init --type java-application \
                  --project-name demojavaproject \
                  --package br.com.exemplo \
                  --test-framework junit #\
                  #-Dhttp.proxyHost=192.168.0.2 -Dhttp.proxyPort=3128 -Dhttp.proxyUser=cid2 -Dhttp.proxyPort=cid2                  
      pwd
      ls -la
   #+END_SRC

   #+RESULTS:
   #+begin_example

   [wagner@Unknown demojavaproj]$ [wagner@Unknown demojavaproj]$ [wagner@Unknown demojavaproj]$ [wagner@Unknown projetos]$ [wagner@Unknown projetos]$ [wagner@Unknown demojavaproj]$ > > > Starting a Gradle Daemon (subsequent builds will be faster)
   Task :wrapper
   Task :init

   BUILD SUCCESSFUL in 3s
   2 actionable tasks: 2 executed
   [wagner@Unknown demojavaproj]$ /home/wagner/wagnerdocri@gmail.com3/envs/env-dev/sources/somewritings/gradle-introduction/projetos/demojavaproj
   total 44
   drwxrwxr-x. 5 wagner wagner 4096 jul 21 21:05 .
   drwxrwxr-x. 4 wagner wagner 4096 jul 21 21:05 ..
   -rw-rw-r--. 1 wagner wagner  949 jul 21 21:05 build.gradle
   -rw-rw-r--. 1 wagner wagner  103 jul 21 21:05 .gitignore
   drwxrwxr-x. 4 wagner wagner 4096 jul 21 21:05 .gradle
   drwxrwxr-x. 3 wagner wagner 4096 jul 21 21:05 gradle
   -rwxrwxr-x. 1 wagner wagner 5305 jul 21 21:05 gradlew
   -rw-rw-r--. 1 wagner wagner 2269 jul 21 21:05 gradlew.bat
   -rw-rw-r--. 1 wagner wagner  363 jul 21 21:05 settings.gradle
   drwxrwxr-x. 4 wagner wagner 4096 jul 21 21:05 src
   #+end_example

   Nos comandos acima, o mais importante foi gradle init que pode ser
   dado também com o gradle --task :init


* Conhecendo a estrutura do nosso projeto   
  
  Segue abaixo a estrutura do projeto. O importante é conhecer pra que
  que serve cada um arquivo e diretório, o professor vai ler com vcs em sala de aula e
  explicar cada um desses arquivos.
  

** O arquivo build.gradle

     #+BEGIN_src groovy
 /*
 ,* This file was generated by the Gradle 'init' task.
 ,*
 ,* This generated file contains a sample Java project to get you started.
 ,* For more details take a look at the Java Quickstart chapter in the Gradle
 ,* user guide available at https://docs.gradle.org/5.1.1/userguide/tutorial_java_projects.html
 ,*/

plugins {
    // Apply the java plugin to add support for Java
    id 'java'

    // Apply the application plugin to add support for building an application
    id 'application'
}

repositories {
    // Use jcenter for resolving your dependencies.
    // You can declare any Maven/Ivy/file repository here.
    jcenter()
}

dependencies {
    // This dependency is found on compile classpath of this component and consumers.
    implementation 'com.google.guava:guava:26.0-jre'

    // Use JUnit test framework
    testImplementation 'junit:junit:4.12'
}

// Define the main class for the application
mainClassName = 'br.com.exemplo.App'
     #+END_src


** O arquivo .gitignore

   Se o seu projeto não tiver um, pode criar.
   O professore vai explicar em sala sobre esse arquivo.



** O diretório .gradle


** O diretório  gradle

     Diretório de cache do gradle


** O arquivo gradlew

     Um shellscript pra usar o o comando gradlew (gradle wrapper) no
     linux

** O arquivo gradlew.bat 

     Arquivo de lote pra usar o comando gradlew (gradle wrapper) no
     windows


