gradle-introduction/gradle-introducao.md
---
title: Gradle Introdução
author: wagner
layout: home
date: 2019-07-21
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgfa9c1c3">1. Introdução</a></li>
<li><a href="#orgf807e48">2. Instalação do Gradle e Conf do Path</a></li>
<li><a href="#org814e400">3. Criação de um projeto java básico</a></li>
<li><a href="#org969848b">4. Conhecendo a estrutura do nosso projeto</a>
<ul>
<li><a href="#org64b2704">4.1. O arquivo build.gradle</a></li>
<li><a href="#org40224d6">4.2. O arquivo .gitignore</a></li>
<li><a href="#orga5599e6">4.3. O diretório .gradle</a></li>
<li><a href="#org6b15c62">4.4. O diretório  gradle</a></li>
<li><a href="#org6e0f0d7">4.5. O arquivo gradlew</a></li>
<li><a href="#orgc0c3d98">4.6. O arquivo gradlew.bat</a></li>
<li><a href="#org4e88212">4.7. settings.gradle</a></li>
<li><a href="#org2565014">4.8. src</a></li>
<li><a href="#org983c045">4.9. src/main/java/br/com/exemplo/App.java</a></li>
<li><a href="#org896bf64">4.10. src/test/java/br/com/exemplo/AppTest.java</a></li>
</ul>
</li>
<li><a href="#org734f38e">5. Buildando e Executando o projeto</a>
<ul>
<li><a href="#org29c80c9">5.1. Executando o nosso programa</a></li>
</ul>
</li>
<li><a href="#org7e8cf4a">6. Fluxo de trabalho dom o gradle</a></li>
<li><a href="#orgabe9ec2">7. Tasks do gradle</a></li>
<li><a href="#org62a13b2">8. Referencias</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgfa9c1c3" class="outline-2">
<h2 id="orgfa9c1c3"><span class="section-number-2">1</span> Introdução</h2>
</div>


<div id="outline-container-orgf807e48" class="outline-2">
<h2 id="orgf807e48"><span class="section-number-2">2</span> Instalação do Gradle e Conf do Path</h2>
<div class="outline-text-2" id="text-2">
<p>
Faça o download do gradle em 
<a href="https://downloads.gradle.org/distributions/gradle-5.5-rc-4-bin.zip">https://downloads.gradle.org/distributions/gradle-5.5-rc-4-bin.zip</a>
</p>

<p>
Descompacte em o gradle em algum diretório, eu descompactei o meu em
</p>

<p>
/home/wagner/wagnerdocri@gmail.com3/fzlbpms/fzlStudio/integrated/build/gradle-5.1.1
</p>

<p>
Agora crie a variável de ambiente GRADLE<sub>HOME</sub> e configure o PATH da
sua máquina.
</p>

<div class="org-src-container">
<pre class="src src-shell" id="org25d18f7"><span style="color: #b0c4de;">export</span> <span style="color: #eedd82;">GRADLE_HOME</span>=/home/wagner/wagnerdocri@gmail.com3/fzlbpms/fzlStudio/integrated/build/gradle-5.1.1
<span style="color: #b0c4de;">export</span> <span style="color: #eedd82;">PATH</span>=$<span style="color: #eedd82;">PATH</span>:$<span style="color: #eedd82;">GRADLE_HOME</span>/bin     
gradle -v
</pre>
</div>

<pre class="example">

------------------------------------------------------------
Gradle 5.1.1
------------------------------------------------------------

Build time:   2019-01-10 23:05:02 UTC
Revision:     3c9abb645fb83932c44e8610642393ad62116807

Kotlin DSL:   1.1.1
Kotlin:       1.3.11
Groovy:       2.5.4
Ant:          Apache Ant(TM) version 1.9.13 compiled on July 10 2018
JVM:          1.8.0_191 (Oracle Corporation 25.191-b12)
OS:           Linux 5.1.18-200.fc29.x86_64 amd64

</pre>
</div>
</div>

<div id="outline-container-org814e400" class="outline-2">
<h2 id="org814e400"><span class="section-number-2">3</span> Criação de um projeto java básico</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="https://guides.gradle.org/building-java-applications/">https://guides.gradle.org/building-java-applications/</a>
</p>

<p>
Pra criar um projeto com gradle a gente cria uma pasta, entra nela e
dá o comando gradle init + parametros.
Esse "init" é um plugin do gradle[gradleCodsInitPlugin]
</p>

<div class="org-src-container">
<pre class="src src-shell" id="org3a58fe6"><span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">starts code</span>
<span style="color: #b0c4de;">export</span> <span style="color: #eedd82;">GRADLE_PROJECTS_DIR</span>=/home/wagner/wagnerdocri@gmail.com3/envs/env-dev/sources/somewritings/gradle-introduction/projetos/                                 
mkdir -p $<span style="color: #eedd82;">GRADLE_PROJECTS_DIR</span>

<span style="color: #b0c4de;">cd</span> $<span style="color: #eedd82;">GRADLE_PROJECTS_DIR</span>
rm -rf demojavaproj
mkdir demojavaproj &amp;&amp; <span style="color: #b0c4de;">cd</span> demojavaproj
<span style="color: #b0c4de;">echo</span> 1 | gradle init --type java-application <span style="color: #ffa07a;">\</span>
            --project-name demojavaproject <span style="color: #ffa07a;">\</span>
            --package br.com.exemplo <span style="color: #ffa07a;">\</span>
            --test-framework junit <span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">\</span>
            <span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">-Dhttp.proxyHost=192.168.0.2 -Dhttp.proxyPort=3128 -Dhttp.proxyUser=cid2 -Dhttp.proxyPort=cid2                  </span>
<span style="color: #b0c4de;">pwd</span>
ls -la
</pre>
</div>

<pre class="example">

[wagner@Unknown demojavaproj]$ [wagner@Unknown demojavaproj]$ [wagner@Unknown demojavaproj]$ [wagner@Unknown projetos]$ [wagner@Unknown projetos]$ [wagner@Unknown demojavaproj]$ &gt; &gt; &gt; Starting a Gradle Daemon (subsequent builds will be faster)
Task :wrapper
Task :init

BUILD SUCCESSFUL in 3s
2 actionable tasks: 2 executed
[wagner@Unknown demojavaproj]$ /home/wagner/wagnerdocri@gmail.com3/envs/env-dev/sources/somewritings/gradle-introduction/projetos/demojavaproj
total 44
drwxrwxr-x. 5 wagner wagner 4096 jul 21 21:05 .
drwxrwxr-x. 4 wagner wagner 4096 jul 21 21:05 ..
-rw-rw-r--. 1 wagner wagner  949 jul 21 21:05 build.gradle
-rw-rw-r--. 1 wagner wagner  103 jul 21 21:05 .gitignore
drwxrwxr-x. 4 wagner wagner 4096 jul 21 21:05 .gradle
drwxrwxr-x. 3 wagner wagner 4096 jul 21 21:05 gradle
-rwxrwxr-x. 1 wagner wagner 5305 jul 21 21:05 gradlew
-rw-rw-r--. 1 wagner wagner 2269 jul 21 21:05 gradlew.bat
-rw-rw-r--. 1 wagner wagner  363 jul 21 21:05 settings.gradle
drwxrwxr-x. 4 wagner wagner 4096 jul 21 21:05 src
</pre>

<p>
Nos comandos acima, o mais importante foi gradle init que pode ser
dado também com o gradle &#x2013;task :init
</p>
</div>
</div>


<div id="outline-container-org969848b" class="outline-2">
<h2 id="org969848b"><span class="section-number-2">4</span> Conhecendo a estrutura do nosso projeto</h2>
<div class="outline-text-2" id="text-4">
<p>
Segue abaixo a estrutura do projeto. O importante é conhecer pra que
que serve cada um arquivo e diretório, o professor vai ler com vcs em sala de aula e
explicar cada um desses arquivos.
</p>
</div>


<div id="outline-container-org64b2704" class="outline-3">
<h3 id="org64b2704"><span class="section-number-3">4.1</span> O arquivo build.gradle</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-groovy"> <span style="color: #ff7f24;">/*</span>
<span style="color: #ff7f24;"> * This file was generated by the Gradle 'init' task.</span>
<span style="color: #ff7f24;"> *</span>
<span style="color: #ff7f24;"> * This generated file contains a sample Java project to get you started.</span>
<span style="color: #ff7f24;"> * For more details take a look at the Java Quickstart chapter in the Gradle</span>
<span style="color: #ff7f24;"> * user guide available at https://docs.gradle.org/5.1.1/userguide/tutorial_java_projects.html</span>
<span style="color: #ff7f24;"> */</span>

plugins {
    <span style="color: #ff7f24;">// Apply the java plugin to add support for Java</span>
    id <span style="color: #ffa07a;">'java'</span>

    <span style="color: #ff7f24;">// Apply the application plugin to add support for building an application</span>
    id <span style="color: #ffa07a;">'application'</span>
}

repositories {
    <span style="color: #ff7f24;">// Use jcenter for resolving your dependencies.</span>
    <span style="color: #ff7f24;">// You can declare any Maven/Ivy/file repository here.</span>
    jcenter()
}

dependencies {
    <span style="color: #ff7f24;">// This dependency is found on compile classpath of this component and consumers.</span>
    implementation <span style="color: #ffa07a;">'com.google.guava:guava:26.0-jre'</span>

    <span style="color: #ff7f24;">// Use JUnit test framework</span>
    testImplementation <span style="color: #ffa07a;">'junit:junit:4.12'</span>
}

<span style="color: #ff7f24;">// Define the main class for the application</span>
mainClassName = <span style="color: #ffa07a;">'br.com.exemplo.App'</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org40224d6" class="outline-3">
<h3 id="org40224d6"><span class="section-number-3">4.2</span> O arquivo .gitignore</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Se o seu projeto não tiver um, pode criar.
O professore vai explicar em sala sobre esse arquivo.
</p>
</div>
</div>



<div id="outline-container-orga5599e6" class="outline-3">
<h3 id="orga5599e6"><span class="section-number-3">4.3</span> O diretório .gradle</h3>
</div>


<div id="outline-container-org6b15c62" class="outline-3">
<h3 id="org6b15c62"><span class="section-number-3">4.4</span> O diretório  gradle</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Diretório de cache do gradle
</p>
</div>
</div>


<div id="outline-container-org6e0f0d7" class="outline-3">
<h3 id="org6e0f0d7"><span class="section-number-3">4.5</span> O arquivo gradlew</h3>
<div class="outline-text-3" id="text-4-5">
<p>
Um shellscript pra usar o o comando gradlew (gradle wrapper) no
linux
</p>
</div>
</div>

<div id="outline-container-orgc0c3d98" class="outline-3">
<h3 id="orgc0c3d98"><span class="section-number-3">4.6</span> O arquivo gradlew.bat</h3>
<div class="outline-text-3" id="text-4-6">
<p>
Arquivo de lote pra usar o comando gradlew (gradle wrapper) no
windows
</p>
</div>
</div>
