gradle-introduction/gradle-introducao.md

<div id="outline-container-org734f38e" class="outline-2">
<h2 id="org734f38e"><span class="section-number-2">5</span> Buildando e Executando o projeto</h2>
<div class="outline-text-2" id="text-5">
<p>
Entre escrever um código e rodá-lo, precisa gerar os bytecodes
(buildar) empacotar.
Pra efeitos do nosso projetinho de exemplo, empacotar significa
gerar um arquivo jar que possa ser executável.
Não vai pensar que é todo jar que é executável heinn&#x2026; Você vai
lembrar que vários jars servem apenas como bibliotecas, lembra?
Então um jar pra ser executável mesmo vc precisar configuar no
MANIFEST.mf qual a
classe que tem o método main. Agente vai ver isso daqui a pouco.
</p>

<p>
Bom, pelo código java dá pra perceber que a funcionalidade dele é
emitir uma saudação, e a classe de teste testa  se a
saudação não é nula.
</p>


<div class="org-src-container">
<pre class="src src-shell" id="org1ab6001"><span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">starts code</span>
<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">cd $GRADLE_PROJECTS_DIR/demojavaproj</span>
<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">echo "org.gradle.daemon=true" &gt; gradle.properties</span>
<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">echo "org.gradle.parallel=true" &gt;&gt; gradle.properties</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell" id="org8665677"><span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">starts code</span>
<span style="color: #b0c4de;">cd</span> $<span style="color: #eedd82;">GRADLE_PROJECTS_DIR</span>/demojavaproj &amp;&amp; ./gradlew build
</pre>
</div>


<div class="org-src-container">
<pre class="src src-shell" id="org9188da2"><span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">starts code</span>
<span style="color: #b0c4de;">cd</span> $<span style="color: #eedd82;">GRADLE_PROJECTS_DIR</span>/demojavaproj &amp;&amp; ./gradlew tasks
</pre>
</div>


<pre class="example">
   [wagner@Unknown gradle-introduction]$ gradle -v

------------------------------------------------------------
Gradle 5.1.1
------------------------------------------------------------

Build time:   2019-01-10 23:05:02 UTC
Revision:     3c9abb645fb83932c44e8610642393ad62116807

Kotlin DSL:   1.1.1
Kotlin:       1.3.11
Groovy:       2.5.4
Ant:          Apache Ant(TM) version 1.9.13 compiled on July 10 2018
JVM:          1.8.0_201 (Oracle Corporation 25.201-b09)
OS:           Linux 4.20.5-200.fc29.x86_64 amd64

[wagner@Unknown gradle-introduction]$ gradle build
Starting a Gradle Daemon, 1 incompatible Daemon could not be reused, use --status for details

&gt; Task :buildEnvironment

------------------------------------------------------------
Root project
------------------------------------------------------------

classpath
No dependencies

A web-based, searchable dependency report is available by adding the --scan option.

BUILD SUCCESSFUL in 4s
1 actionable task: 1 executed
[wagner@Unknown gradle-introduction]$ 

</pre>


<p>
Mas a gente faz o build pra que mesmo? A resposta é: pra obter o
nosso projeto como um pacote, ou seja, um arquivo só que pode ser
utilizado. A maioria das pessoas já pensa num arquivo .exe mas o
java pode gerar vários tipos de arquivos inclusive um executável
embora a extensão não seja exe mas .jar, isso mesmo um arquivo
executável com a extensão .jar
Um jar pode ser um arquivo executável ou não, se a gente quer que
ele seja a gente configura o arquivo MANIFEST dele pra que ele seja e se a
gente não quer que ele seja executável a gente não configura.
É muito comum que um arquivo jar não seja executável. As
dependencias dos nossos projetos java, e vc vai lembrar quando a
gente trabalha com jdbc, por exemplo, que tem que usar a
dependencia jdbc do banco que é um jar.. aquele jar do jdbc não era
executável. Aquele jar do jdbc nada mais era que código java empacotado que serve pra gente usar nos
nossos projetos.
Se vc não entendeu isso o professor escalarece pra vc na sala de
aula.
Então a gente deu um gradle build e ele deve então ter gerado o
nosso projeto como um pacote certo? Vamos ver&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-shell" id="org3a35b33"><span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">starts code</span>
<span style="color: #b0c4de;">cd</span> $<span style="color: #eedd82;">GRADLE_PROJECTS_DIR</span>/demojavaproj
ls -l 
ls -l build
ls -l build/distributions
</pre>
</div>

<pre class="example">

[wagner@Unknown demojavaproj]$ total 32
drwxrwxr-x. 9 wagner wagner 4096 fev  3 14:21 build
-rw-rw-r--. 1 wagner wagner  949 fev  3 14:16 build.gradle
drwxrwxr-x. 3 wagner wagner 4096 fev  3 14:16 gradle
-rwxrwxr-x. 1 wagner wagner 5305 fev  3 14:16 gradlew
-rw-rw-r--. 1 wagner wagner 2269 fev  3 14:16 gradlew.bat
-rw-rw-r--. 1 wagner wagner  363 fev  3 14:16 settings.gradle
drwxrwxr-x. 4 wagner wagner 4096 fev  3 14:16 src
total 28
drwxrwxr-x. 3 wagner wagner 4096 fev  3 14:21 classes
drwxrwxr-x. 2 wagner wagner 4096 fev  3 14:21 distributions
drwxrwxr-x. 2 wagner wagner 4096 fev  3 14:21 libs
drwxrwxr-x. 3 wagner wagner 4096 fev  3 14:21 reports
drwxrwxr-x. 2 wagner wagner 4096 fev  3 14:21 scripts
drwxrwxr-x. 3 wagner wagner 4096 fev  3 14:21 test-results
drwxrwxr-x. 5 wagner wagner 4096 fev  3 14:21 tmp
total 5488
-rw-rw-r--. 1 wagner wagner 3000320 fev  3 14:21 demojavaproject.tar
-rw-rw-r--. 1 wagner wagner 2615429 fev  3 14:21 demojavaproject.zip
</pre>

<p>
Acima a gente vê o resultado do nosso build. É um diretório chamado
build que dentro dele tem as compilação das classes java dentre
outros artefatos resultantes do build.
No diretório build/distributions tem o nosso projeto empacotado
como .tar e como .zip
O arquivo .tar é mais comumente utilizado no linux, e o zip com
certeza vc já conhece.
</p>



<div class="org-src-container">
<pre class="src src-sh" id="org1e7cffe"><span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">starts code</span>
<span style="color: #b0c4de;">cd</span> $<span style="color: #eedd82;">GRADLE_PROJECTS_DIR</span>/demojavaproj/build/distributions            
unzip demojavaproject.zip 2&gt;&amp;1
<span style="color: #b0c4de;">cd</span> demojavaproject
ls -l
ls -l bin
<span style="color: #b0c4de;">cd</span> bin
<span style="color: #b0c4de;">pwd</span>
<span style="color: #b0c4de;">cd</span> ..
ls -l lib
</pre>
</div>

<pre class="example">

[wagner@Unknown distributions]$ Archive:  demojavaproject.zip
   creating: demojavaproject/
   creating: demojavaproject/lib/
  inflating: demojavaproject/lib/demojavaproject.jar  
  inflating: demojavaproject/lib/guava-26.0-jre.jar  
  inflating: demojavaproject/lib/jsr305-3.0.2.jar  
  inflating: demojavaproject/lib/checker-qual-2.5.2.jar  
  inflating: demojavaproject/lib/error_prone_annotations-2.1.3.jar  
  inflating: demojavaproject/lib/j2objc-annotations-1.1.jar  
  inflating: demojavaproject/lib/animal-sniffer-annotations-1.14.jar  
   creating: demojavaproject/bin/
  inflating: demojavaproject/bin/demojavaproject  
  inflating: demojavaproject/bin/demojavaproject.bat
[wagner@Unknown demojavaproject]$ total 8
drwxr-xr-x. 2 wagner wagner 4096 fev  3 15:22 bin
drwxr-xr-x. 2 wagner wagner 4096 fev  3 15:22 lib
total 12
-rwxr-xr-x. 1 wagner wagner 5504 fev  3 15:22 demojavaproject
-rwxr-xr-x. 1 wagner wagner 2496 fev  3 15:22 demojavaproject.bat
[wagner@Unknown bin]$ /home/wagner/wagnerdocri@gmail.com3/envs/env-dev/sources/somewritings/gradle-introduction/projetos/demojavaproj/build/distributions/demojavaproject/bin
[wagner@Unknown demojavaproject]$ total 2928
-rw-rw-r--. 1 wagner wagner    3482 jan  5 22:51 animal-sniffer-annotations-1.14.jar
-rw-rw-r--. 1 wagner wagner  193322 fev  3 13:10 checker-qual-2.5.2.jar
-rw-rw-r--. 1 wagner wagner    1064 fev  3 15:22 demojavaproject.jar
-rw-rw-r--. 1 wagner wagner   13704 fev  3 13:10 error_prone_annotations-2.1.3.jar
-rw-rw-r--. 1 wagner wagner 2740721 fev  3 13:10 guava-26.0-jre.jar
-rw-rw-r--. 1 wagner wagner    8764 jan  5 22:51 j2objc-annotations-1.1.jar
-rw-rw-r--. 1 wagner wagner   19936 fev  3 13:10 jsr305-3.0.2.jar
</pre>


<p>
Pessoal, vamos lá compreender nosso build&#x2026;
Unzipei o projeto que gerou uma pasta do proje com o diretório bin
e o diretório lib
O diretório bin tem dois arquivos um bat e ouhtro pra executar no
linux.
A pasta lib tem alguns jars de que nosso projeto depende e muito
interessante tem o demojavaproject.jar
Cada um deles, obviamente, tem sua razão de estar alí. Não vou
entrar em cada um mas vou passar uns links&#x2026;
</p>

<ul class="org-ul">
<li><p>
jsr305-3.0.2.jar
</p>

<p>
Disponibiliza anotações para qualidade de código
<a href="https://www.infoq.com/news/2008/06/jsr-305-update">https://www.infoq.com/news/2008/06/jsr-305-update</a>
<a href="https://www.youtube.com/watch?v=J2fgb8nWUo8">https://www.youtube.com/watch?v=J2fgb8nWUo8</a>
</p></li>

<li><p>
animal-sniffer-annotations-1.14.jar
</p>

<p>
Útil qdo vc tem código de uma versão do java que precisa rodar em
uma versão diferente que sem o animal-siffer seria incompatível.
<a href="https://www.baeldung.com/maven-animal-sniffer">https://www.baeldung.com/maven-animal-sniffer</a>
</p></li>

<li><p>
checker-qual-2.5.2.jar
</p>

<p>
Ferramenta de qualidade de código
<a href="https://checkerframework.org/manual/#installation">https://checkerframework.org/manual/#installation</a>
</p></li>

<li>demojavaproject.jar
Esse é o jar do nosso projeto. Infelizmente o gradle não
configurou ele pra ser um executável, conforme demostra o código
abaixo.
Entretanto, o gradle te dá maneiras que, a meu veu, eles acham
que é mais prática pra executar o seu projeto que são os arquivos
executáveis que a gente já viu anteriormente neste texto.</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell" id="org103cfd8"><span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">starts code</span>
<span style="color: #b0c4de;">cd</span> $<span style="color: #eedd82;">GRADLE_PROJECTS_DIR</span>/demojavaproj/build/distributions/demojavaproject/lib
java -jar demojavaproject.jar
</pre>
</div>

<pre class="example">

[wagner@Unknown lib]$ nenhum atributo de manifesto principal em demojavaproject.jar

</pre>

<ul class="org-ul">
<li>error<sub>prone</sub><sub>annotations</sub>-2.1.3.jar
Análise estática do código pra melhora da qualidade. Tem um
exemplo fácil de entendem em <a href="https://github.com/google/error-prone">https://github.com/google/error-prone</a></li>
</ul>


<ul class="org-ul">
<li>guava-26.0-jre.jar
Esse jar é uma biblioteca do criada pela google pra facilitar
algumas tarefas em java com collections etc.
Esse link abaixo mostra como se configura ela no seu projeto    
<a href="https://github.com/google/guava/wiki/UseGuavaInYourBuild">https://github.com/google/guava/wiki/UseGuavaInYourBuild</a></li>
</ul>


<ul class="org-ul">
<li>j2objc-annotations-1.1.jar
Esse é o site do projeto desse jar:
<a href="https://developers.google.com/j2objc/">https://developers.google.com/j2objc/</a>
A utilidade desse jar é transformar código java em código
objective-C atraves de seus comandos. Como a gente não vai
desenvolver pra IOS não vamos usar essa biblioteca na prática.</li>
</ul>



<p>
Vamos dar uma olhada nos arquivos do diretório bin primeiro, o .bat
Abaixo segue o arquivo, parece meio complicadinho mas a gente não
vei editar ele pra nada, a gente só vai usar pra executar nosso
programa. Se tiver curiosidade, dá uma olhada nele depois.
</p>

<p>
Agora o outro pra ser executado no linux
Mesma coisa, vc não precisa entender shellscript pra executar ele
certo? No futuro estude shellscript que vale a pena&#x2026;   Depois vc
pode dar uma olhada nele também.
</p>
</div>
