gradle-introduction/gradle-introducao.org
** Executando o nosso programa   
   Bom vamos executar nosso programa então...
   
   #+NAME: exec prog                  
   #+BEGIN_SRC shell :session s1 :results output :exports both
      #starts code
      cd $GRADLE_PROJECTS_DIR/demojavaproj/build/distributions/demojavaproject/bin
      ./demojavaproject
   #+END_SRC

   #+RESULTS:
   : 
   : [wagner@Unknown bin]$ Hello world.

   Executando esse arquivo dá pra perceber que o programa foi
   executado.


   To me sentindo culpado por não ter rodado o teste antes, mas
   eis aí.. Na nossa disciplina sobre qualidade de software vcs vão
   entender o por quê?
   
   #+NAME: rod teste                  
   #+BEGIN_SRC shell :session s1 :results output :exports both
      #starts code
      cd $GRADLE_PROJECTS_DIR/demojavaproj
      ./gradlew test
   #+END_SRC
   
   #+BEGIN_EXAMPLE
   [wagner@Unknown demojavaproj]$ ./gradlew test
> Task :compileJava UP-TO-DATE
> Task :processResources NO-SOURCE
> Task :classes UP-TO-DATE
> Task :compileTestJava UP-TO-DATE
> Task :processTestResources NO-SOURCE
> Task :testClasses UP-TO-DATE
> Task :test UP-TO-DATE

BUILD SUCCESSFUL in 0s
3 actionable tasks: 3 up-to-date
[wagner@Unknown demojavaproj]$ 
   #+END_EXAMPLE

   Claro que a gente vai escrever muitos testes na nossa disciplina,
   neste momento a agente apenas rodou esse né... daqui a pouco a
   gente vai estudar e modifcar esse teste.

   Tem um relatório dos testes em html, vamos ver?


   
   #+NAME: test reports                   
   #+BEGIN_SRC shell :session s1 :results output :exports both
      #starts code
      firefox /home/wagner/wagnerdocri@gmail.com3/envs/env-dev/sources/somewritings/gradle-introduction/projetos/demojavaproj/build/reports/tests/test/index.html
   #+END_SRC

   #+RESULTS: test reports


* Fluxo de trabalho dom o gradle   
  Quando vc tiver trabalhando com o seu projeto que usa gradle as taks
  que vc usará em geral são;
  gradle clean, pra limpar tudo que tiver sido construído
  gradle build pra buildar
  gradle test pra testar
  gradle run pra rodar 
  gradle distZip pra gerar um zip do projeto 


* Tasks do gradle
  
  O que vem depois do gradle... o clean o init o build etc... são
  tasks do gradle
  
  O comando gradle tasks mostra as tasks que estão disponíveis pra vc
  utilizar.
  
  
   #+NAME: example gralde tasks                    
   #+BEGIN_SRC shell :session s1 :results output :exports both
      #starts code
      [wagner@Unknown demojavaproj]$ gradle tasks

> Task :tasks

------------------------------------------------------------
Tasks runnable from root project
------------------------------------------------------------

Application tasks
-----------------
run - Runs this project as a JVM application

Build tasks
-----------
assemble - Assembles the outputs of this project.
build - Assembles and tests this project.
buildDependents - Assembles and tests this project and all projects that depend on it.
buildNeeded - Assembles and tests this project and all projects it depends on.
classes - Assembles main classes.
clean - Deletes the build directory.
jar - Assembles a jar archive containing the main classes.
testClasses - Assembles test classes.

Build Setup tasks
-----------------
init - Initializes a new Gradle build.
wrapper - Generates Gradle wrapper files.

Distribution tasks
------------------
assembleDist - Assembles the main distributions
distTar - Bundles the project as a distribution.
distZip - Bundles the project as a distribution.
installDist - Installs the project as a distribution as-is.

Documentation tasks
-------------------
javadoc - Generates Javadoc API documentation for the main source code.

Help tasks
----------
buildEnvironment - Displays all buildscript dependencies declared in root project 'demojavaproject'.
components - Displays the components produced by root project 'demojavaproject'. [incubating]
dependencies - Displays all dependencies declared in root project 'demojavaproject'.
dependencyInsight - Displays the insight into a specific dependency in root project 'demojavaproject'.
dependentComponents - Displays the dependent components of components in root project 'demojavaproject'. [incubating]
help - Displays a help message.
model - Displays the configuration model of root project 'demojavaproject'. [incubating]
projects - Displays the sub-projects of root project 'demojavaproject'.
properties - Displays the properties of root project 'demojavaproject'.
tasks - Displays the tasks runnable from root project 'demojavaproject'.

Verification tasks
------------------
check - Runs all checks.
test - Runs the unit tests.

Rules
-----
Pattern: clean<TaskName>: Cleans the output files of a task.
Pattern: build<ConfigurationName>: Assembles the artifacts of a configuration.
Pattern: upload<ConfigurationName>: Assembles and uploads the artifacts belonging to a configuration.

To see all tasks and more detail, run gradle tasks --all

To see more detail about a task, run gradle help --task <task>

BUILD SUCCESSFUL in 0s
1 actionable task: 1 executed
[wagner@Unknown demojavaproj]$ 

   #+END_SRC
  
Tem bastante né? Com o tempo a gente vai se acostumando com as
funcionalidades de cada uma. A verdade é que elas é que salvam a
patria qdo vc tiver enroscado com alguma questão específica do seu
projeto. Isso vai acontecer quando vc tiver trabalhando na área...


* Referencias
  tarfileWikiPedia https://pt.wikipedia.org/wiki/Tar_(computa%C3%A7%C3%A3o)
  gradleCodsInitPlugin https://docs.gradle.org/current/userguide/build_init_plugin.html
  http://professorramos.com/index.php/script-bat-2-como-criar-um-menu-em-arquivos-bat/
