gradle-introduction/gradle-introducao.md

<div id="outline-container-org29c80c9" class="outline-3">
<h3 id="org29c80c9"><span class="section-number-3">5.1</span> Executando o nosso programa</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Bom vamos executar nosso programa então&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-shell" id="orgb7870af"><span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">starts code</span>
<span style="color: #b0c4de;">cd</span> $<span style="color: #eedd82;">GRADLE_PROJECTS_DIR</span>/demojavaproj/build/distributions/demojavaproject/bin
./demojavaproject
</pre>
</div>

<pre class="example">

[wagner@Unknown bin]$ Hello world.

</pre>

<p>
Executando esse arquivo dá pra perceber que o programa foi
executado.
</p>


<p>
To me sentindo culpado por não ter rodado o teste antes, mas
eis aí.. Na nossa disciplina sobre qualidade de software vcs vão
entender o por quê?
</p>

<div class="org-src-container">
<pre class="src src-shell" id="orge2b61d6"><span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">starts code</span>
<span style="color: #b0c4de;">cd</span> $<span style="color: #eedd82;">GRADLE_PROJECTS_DIR</span>/demojavaproj
./gradlew test
</pre>
</div>

<pre class="example">
   [wagner@Unknown demojavaproj]$ ./gradlew test
&gt; Task :compileJava UP-TO-DATE
&gt; Task :processResources NO-SOURCE
&gt; Task :classes UP-TO-DATE
&gt; Task :compileTestJava UP-TO-DATE
&gt; Task :processTestResources NO-SOURCE
&gt; Task :testClasses UP-TO-DATE
&gt; Task :test UP-TO-DATE

BUILD SUCCESSFUL in 0s
3 actionable tasks: 3 up-to-date
[wagner@Unknown demojavaproj]$ 
</pre>

<p>
Claro que a gente vai escrever muitos testes na nossa disciplina,
neste momento a agente apenas rodou esse né&#x2026; daqui a pouco a
gente vai estudar e modifcar esse teste.
</p>

<p>
Tem um relatório dos testes em html, vamos ver?
</p>



<div class="org-src-container">
<pre class="src src-shell" id="orge99c589"><span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">starts code</span>
firefox /home/wagner/wagnerdocri@gmail.com3/envs/env-dev/sources/somewritings/gradle-introduction/projetos/demojavaproj/build/reports/tests/test/index.html
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org7e8cf4a" class="outline-2">
<h2 id="org7e8cf4a"><span class="section-number-2">6</span> Fluxo de trabalho dom o gradle</h2>
<div class="outline-text-2" id="text-6">
<p>
Quando vc tiver trabalhando com o seu projeto que usa gradle as taks
que vc usará em geral são;
gradle clean, pra limpar tudo que tiver sido construído
gradle build pra buildar
gradle test pra testar
gradle run pra rodar 
gradle distZip pra gerar um zip do projeto 
</p>
</div>
</div>


<div id="outline-container-orgabe9ec2" class="outline-2">
<h2 id="orgabe9ec2"><span class="section-number-2">7</span> Tasks do gradle</h2>
<div class="outline-text-2" id="text-7">
<p>
O que vem depois do gradle&#x2026; o clean o init o build etc&#x2026; são
tasks do gradle
</p>

<p>
O comando gradle tasks mostra as tasks que estão disponíveis pra vc
utilizar.
</p>


<div class="org-src-container">
<pre class="src src-shell" id="org9eed51c">      <span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">starts code</span>
      [wagner@Unknown demojavaproj]$ gradle tasks

&gt; Task :tasks

------------------------------------------------------------
Tasks runnable from root project
------------------------------------------------------------

Application tasks
-----------------
run - Runs this project as a JVM application

Build tasks
-----------
assemble - Assembles the outputs of this project.
build - Assembles and tests this project.
buildDependents - Assembles and tests this project and all projects that depend on it.
buildNeeded - Assembles and tests this project and all projects it depends on.
classes - Assembles main classes.
clean - Deletes the build directory.
jar - Assembles a jar archive containing the main classes.
testClasses - Assembles test classes.

Build Setup tasks
-----------------
init - Initializes a new Gradle build.
wrapper - Generates Gradle wrapper files.

Distribution tasks
------------------
assembleDist - Assembles the main distributions
distTar - Bundles the project as a distribution.
distZip - Bundles the project as a distribution.
installDist - Installs the project as a distribution as-is.

Documentation tasks
-------------------
javadoc - Generates Javadoc API documentation for the main source code.

Help tasks
----------
buildEnvironment - Displays all buildscript dependencies declared<span style="color: #00ffff;"> in</span> root project <span style="color: #ffa07a;">'demojavaproject'</span>.
components - Displays the components produced by root project <span style="color: #ffa07a;">'demojavaproject'</span>. [incubating]
dependencies - Displays all dependencies declared<span style="color: #00ffff;"> in</span> root project <span style="color: #ffa07a;">'demojavaproject'</span>.
dependencyInsight - Displays the insight into a specific dependency<span style="color: #00ffff;"> in</span> root project <span style="color: #ffa07a;">'demojavaproject'</span>.
dependentComponents - Displays the dependent components of components<span style="color: #00ffff;"> in</span> root project <span style="color: #ffa07a;">'demojavaproject'</span>. [incubating]
<span style="color: #b0c4de;">help</span> - Displays a help message.
model - Displays the configuration model of root project <span style="color: #ffa07a;">'demojavaproject'</span>. [incubating]
projects - Displays the sub-projects of root project <span style="color: #ffa07a;">'demojavaproject'</span>.
properties - Displays the properties of root project <span style="color: #ffa07a;">'demojavaproject'</span>.
tasks - Displays the tasks runnable from root project <span style="color: #ffa07a;">'demojavaproject'</span>.

Verification tasks
------------------
check - Runs all checks.
<span style="color: #b0c4de;">test</span> - Runs the unit tests.

Rules
-----
Pattern: clean&lt;TaskName&gt;: Cleans the output files of a task.
Pattern: build&lt;ConfigurationName&gt;: Assembles the artifacts of a configuration.
Pattern: upload&lt;ConfigurationName&gt;: Assembles and uploads the artifacts belonging to a configuration.

To see all tasks and more detail, run gradle tasks --all

To see more detail about a task, run gradle help --task &lt;task&gt;

BUILD SUCCESSFUL<span style="color: #00ffff;"> in</span> 0s
1 actionable task: 1 executed
[wagner@Unknown demojavaproj]$ 

</pre>
</div>

<p>
Tem bastante né? Com o tempo a gente vai se acostumando com as
funcionalidades de cada uma. A verdade é que elas é que salvam a
patria qdo vc tiver enroscado com alguma questão específica do seu
projeto. Isso vai acontecer quando vc tiver trabalhando na área&#x2026;
</p>
</div>
</div>


<div id="outline-container-org62a13b2" class="outline-2">
<h2 id="org62a13b2"><span class="section-number-2">8</span> Referencias</h2>
<div class="outline-text-2" id="text-8">
<p>
tarfileWikiPedia <a href="https://pt.wikipedia.org/wiki/Tar_(computa%C3%A7%C3%A3o)">https://pt.wikipedia.org/wiki/Tar_(computação)</a>
gradleCodsInitPlugin <a href="https://docs.gradle.org/current/userguide/build_init_plugin.html">https://docs.gradle.org/current/userguide/build_init_plugin.html</a>
<a href="http://professorramos.com/index.php/script-bat-2-como-criar-um-menu-em-arquivos-bat/">http://professorramos.com/index.php/script-bat-2-como-criar-um-menu-em-arquivos-bat/</a>
</p>
</div>
</div>
